#ifndef  _power_h_
#define  _power_h_


//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	int16  GetCur(void);

//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	int16  GetVol(void);

//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	int16  GetPow(void);

//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	int32  GetPosEnergy(void);

//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
//extern	void  MathPower(void);

//------------------------------------------------------------------------
// 名称：	void	SendReadPowerCode(void)
// 功能：初始化定时器1，定时时间单位为10ms，并使能中断。
// 入口参数：无
// 出口参数：无
//从设备地址	功能码	起始寄存器地址	寄存器个数	CRC-L	CRC-H
//0x01	0x03	0x00	0x10	0x00	0x07	0x05	0xCD
//------------------------------------------------------------------------
extern	void  ScanPowerAddr(void);

//------------------------------------------------------------------------
// 名称：	void	SendReadPowerCode(void)
// 功能：初始化定时器1，定时时间单位为10ms，并使能中断。
// 入口参数：无
// 出口参数：无
//从设备地址	功能码	起始寄存器地址	寄存器个数	CRC-L	CRC-H
//0x01	0x03	0x00	0x10	0x00	0x07	0x05	0xCD
//------------------------------------------------------------------------
extern	void  SendReadPowerCode(void);

//----------------------------------------------------------------------------
// 名    称：   uint8  GetDipData(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	uint8  GetPowerVal(uint8 *Buf,uint16	Len);

//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	int32  GetNegEnergy(void);

extern	int32  GetInitNegEnergy(void);


//----------------------------------------------------------------------------
// 名    称：   uint8  GetPower(void)
// 功    能：   取油量数据
// 入口参数：   无
// 出口参数：   无
//----------------------------------------------------------------------------
extern	int32  GetInitEnergy(void);
#endif