#ifndef  _CardTest_h_
#define  _CardTest_h_

//------------------------------------------------------------------------------
//名    称：    estDipModel(void)(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    WriteCardOilModelTest(void);

//------------------------------------------------------------------------------
//名    称：    uint8    WriteCardDataCardTest(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    WriteCardDataCardTest(void);

//------------------------------------------------------------------------------
//名    称：    estDipModel(void)(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    WriteCardTimeCardTest(void);

//------------------------------------------------------------------------------
//名    称：    WriteDensityCardTest(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    WriteDensityCardTest(void);

//------------------------------------------------------------------------------
//名    称：    ReadCardIndexTest(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    ReadCardIndexTest(void);

//-------------------------------------------------------------------------------------------------
//函数名称:             void  PrintfCardRec(void) 
//函数功能:             打印记录
//入口参数:             无
//出口参数:             无
//说明:                 
//--------------------------------------------------------------------------------------------------
extern	void  PrintfCardRec(void) ;

//-------------------------------------------------------------------------------------------------
//函数名称:             void  FramToCard(void) 
//函数功能:             铁电数据到IC卡
//入口参数:             无
//出口参数:             无
//说明:                 
//--------------------------------------------------------------------------------------------------
extern	void 	FramToCard(void);

//------------------------------------------------------------------------------
//名    称：    WriteCopyCardTest(void)
//功    能：    复制卡
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    WriteCopyCardTest(void);

//------------------------------------------------------------------------------
//名    称：    WriteCopyCardTest(void)
//功    能：    复制卡
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    WriteCopyFramTest(void);

#endif