#ifndef  _DataCard_h_
#define  _DataCard_h_

//-------------------------------------------------------------------------------------------------
//函数名称:             void	OperationNormCard(void);	   
//函数功能:             普通卡处理
//入口参数:             无
//出口参数:             无
//--------------------------------------------------------------------------------------------------
//extern	void	DataCard(stcCardFlg	* sCardFlg);

//-------------------------------------------------------------------------------------------------
//函数名称:             void	DataCardPartRead(void)
//函数功能:             普通卡处理
//入口参数:             无
//出口参数:             无
//--------------------------------------------------------------------------------------------------
extern	void	DataCardPartRead(void);
#endif
