#ifndef  _Display_h_
#define  _Display_h_

//-------------------------------------------------------------------
//函数名称:     InitDisplay ()
//功    能:     7219初始化
//入口参数:     无
//出口参数:     无
//-------------------------------------------------------------------
extern void InitDisplay (void);

//-----------------------------------------------------------------------------------
//函数名称:               DisplayNum ()
//功    能:               用数码管将整型数据显示出来
//入口参数:               number
//出口参数:               无
//------------------------------------------------------------------------------------
extern void    DisplayNum (uint32 Unmber);

//-----------------------------------------------------------------------------
//函数名称:             MovDisplayChar ()
//功    能:             用数码管显示字符即已定字符
//入口参数:             character: 字符代码
//出口参数:             无
//显示内容:             -   E   H   L   P   Black
//内容代码:     	    A	B	C	D	E	F	  
//-----------------------------------------------------------------------------
extern void    MovDisplayChar (uint8 Character);

//--------------------------------------------------------------------
//void          DisplayNumWithDoit (uint32 Unmber)
//功    能:     用数码管将整型数据显示出来
//入口参数:     number
//出口参数:     无
//-------------------------------------------------------------------
extern void    DisplayNumWithDot (uint32 Unmber);

//------------------------------------------------------
//函数名称:     DisplayString ()
//功    能:     用数码管显示字符串代码
//入口参数:     String: 字符代码
//出口参数:     无
//显示内容:     String
//内容代码:	    调用格式  DisplayString("ABCD");
//-------------------------------------------------------
extern void     DisplayString(int8 *String);

//----------------------------------------------------------------------------
// 名    称：   uint32 Displayf(char *fmt, va_list param) 
// 功    能：   
// 入口参数：  

// 出口参数：   
//----------------------------------------------------------------------------  
extern uint32 Displayf(char *fmt, ...) ;

//----------------------------------------------------------------------------
// 名    称：   uint32 DisplaySet(char *fmt, va_list param) 
// 功    能：   
// 入口参数：  

// 出口参数：   
//----------------------------------------------------------------------------  
extern	uint32 DisplaySet(uint32 Time,uint32 Degree,char *fmt, ... ) ;

//----------------------------------------------------------------------------
// 名    称：   void HoldDisplay(void) 
// 功    能：   显示维护	
// 入口参数：  

// 出口参数：   
//----------------------------------------------------------------------------  
extern	void HoldDisplay(void) ;

//----------------------------------------------------------------------------
// 名    称：   void TestDisplay(void) 
// 功    能：   
// 入口参数：  

// 出口参数：   
//----------------------------------------------------------------------------  
extern	void TestDisplay(void) ;

//----------------------------------------------------------------------------
// 名    称：   void ClaerDisplaySet(void)
// 功    能：   
// 入口参数：  

// 出口参数：   
//----------------------------------------------------------------------------  
extern	void ClaerDisplaySet(void);

//----------------------------------------------------------------------------
// 名    称：   void ResumeDisplaySet(void)
// 功    能：   
// 入口参数：  

// 出口参数：   
//----------------------------------------------------------------------------  
extern	void ResumeDisplaySet(void);

#endif