#ifndef  _led_h_
#define  _led_h_
//------------------------------------------------------------------------
//	名	称 ：void InitLed( void )
//	功	能 ：指示灯初始化
// 入口参数：
// 出口参数：
//------------------------------------------------------------------------
extern	void InitLed( void );

//------------------------------------------------------------------------
//	名	称 ：void HoldLed(void)
//	功	能 ：指示灯维护
// 入口参数：
// 出口参数：
//------------------------------------------------------------------------
extern	void HoldLed(void);

//------------------------------------------------------------------------
//	名	称 ：void OnLed(uint8 num,uint32 times,uint16 LightTime,uint16 unLightTime)
//	功	能 ：控制指示灯
// 入口参数：uint8 Num			亮灯的对应序号	 参照 Driver.h 有关声明
//			 uint16	times			蜂鸣器响的次数
//			 uint16	LightTime		响的时间  以 0.1s为单位
//			 uint16	unLightTime		不响的时间 以 0.1s 为单位
// 出口参数：操作成功返回 TRUE	操作失败返回 FAULSE
//------------------------------------------------------------------------
extern	void OnLed(uint8 num,uint32 times,uint16	LightTime,uint16 unLightTime);

//------------------------------------------------------------------------
//	名	称 ：void OffAllLed(void)
//	功	能 ：
// 入口参数：无
// 出口参数：
//------------------------------------------------------------------------
extern	void OnAllLed(void);

//------------------------------------------------------------------------
//	名	称 ：void LedOff(uint8 LedNum)
//	功	能 ：关闭对应序号指示灯
// 入口参数：无 
// 出口参数：
//------------------------------------------------------------------------
extern	void OffLed(uint8 num);

//------------------------------------------------------------------------
//	名	称 ：void OffAllLed(void)
//	功	能 ：
// 入口参数：无
// 出口参数：
//------------------------------------------------------------------------
extern	void OffAllLed(void);

//------------------------------------------------------------------------
//	名	称 ：void TestLed( void )
//	功	能 ：测试发光二极管指示灯
// 入口参数：
// 出口参数：
//------------------------------------------------------------------------
extern	void TestLed( void );

//------------------------------------------------------------------------
//	名	称 ：void LedUnLight(void)
//	功	能 ：指示灯持续灭
// 入口参数：
// 出口参数：
//------------------------------------------------------------------------
extern	void UnLightLed(uint8 num);

//------------------------------------------------------------------------
//	名	称 ：void LedLight(void)
//	功	能 ：指示灯持续亮
// 入口参数：
// 出口参数：
//------------------------------------------------------------------------
extern	void LightLed(uint8 num);

#endif