#ifndef  _DealOilBox_h_
#define  _DealOilBox_h_

//------------------------------------------------------------------------------
//名    称：    stcModel    GetOilBoxModel(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetOilBoxModel( stcModelComplex * sModel);

//------------------------------------------------------------------------------
//名    称：    estDipModel(void)(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8    TestDipModel(void);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf4bOilBoxModel(void)
//功    能：    DF4b油箱模型
//入口参数：    无
//出口参数：    DF4b的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf4bOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf8bOilBoxModel(void)
//功    能：    DF8b油箱模型
//入口参数：    无
//出口参数：    DF8b的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf8bOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf7cOilBoxModel(void)
//功    能：    Df7c油箱模型
//入口参数：    无
//出口参数：    Df7c的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf7cOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf4bOilBoxModel(void)
//功    能：    DF4b油箱模型
//入口参数：    无
//出口参数：    DF4b的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf11OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf8bOilBoxModel(void)
//功    能：    DF8b油箱模型
//入口参数：    无
//出口参数：    DF8b的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf8OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf7cOilBoxModel(void)
//功    能：    Df7c油箱模型
//入口参数：    无
//出口参数：    Df7c的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf7xOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf4dOilBoxModel(void)
//功    能：    Df4d油箱模型
//入口参数：    无
//出口参数：    Df4d的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf4dOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf5OilBoxModel(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8   GetDf5OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf7xOilBoxModel(void)
//功    能：    DF7x油箱模型
//入口参数：    无
//出口参数：    DF7x的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf12G40OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf7xOilBoxModel(void)
//功    能：    DF7x油箱模型
//入口参数：    无
//出口参数：    DF7x的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf12G17OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf7xOilBoxModel(void)
//功    能：    DF7x油箱模型
//入口参数：    无
//出口参数：    DF7x的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf5G20OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf11OilBoxModel(void)
//功    能：    DF11油箱模型
//入口参数：    无
//出口参数：    DF11的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf11OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf8OilBoxModel(void)
//功    能：    DF8油箱模型
//入口参数：    无
//出口参数：    DF8的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf8OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf8bOilBoxModel(void)
//功    能：    DF8b油箱模型
//入口参数：    无
//出口参数：    DF8b的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf8bOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf7cOilBoxModel(void)
//功    能：    Df7c油箱模型
//入口参数：    无
//出口参数：    Df7c的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf7cOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf4dOilBoxModel(void)
//功    能：    Df4d油箱模型
//入口参数：    无
//出口参数：    Df4d的油箱模型
//------------------------------------------------------------------------------
extern	uint8    GetDf4dOilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------------
//名    称：    stcModel    GetDf5OilBoxModel(void)
//功    能：    Df5油箱模型
//入口参数：    无
//出口参数：    Df5的油箱模型
//------------------------------------------------------------------------------
extern	uint8   GetDf5OilBoxModel(stcModel * sModel);

//------------------------------------------------------------------------
//  名  称 ：uint8 ReadSCL(void)
//  功  能 ：读取 SCL 的值
// 入口参数：无
// 出口参数：无
//------------------------------------------------------------------------
extern	uint8 ReadOilBoxCod(void);

//------------------------------------------------------------------------------
//名    称：    uint8   GetOilBoxCod(void)
//功    能：    取油箱模型号
//入口参数：    油箱模型指针
//出口参数：    无
//------------------------------------------------------------------------------
extern	uint8   GetOilBoxCod(void);

//------------------------------------------------------------------------------
//名    称：    void   stcModelComplexTostcModel(stcModel* sComplexModel,stcModelComplex * sModel)
//功    能：    取油箱模型
//入口参数：    油箱模型指针
//出口参数：    无
//------------------------------------------------------------------------------
extern	void   stcModelComplexTostcModel(stcModel* sModel,stcModelComplex * sComplexModel);

//------------------------------------------------------------------------------
//名    称：    void   stcModelComplexTostcModel(stcModel* sComplexModel,stcModelComplex * sModel)
//功    能：    取油箱模型
//入口参数：    油箱模型指针
//出口参数：    无
//------------------------------------------------------------------------------
extern	void   stcModelComplexToMulstcModel(stcModel* sModel,stcModelComplex * sComplexModel,uint16	ReserveNum);

//------------------------------------------------------------------------------
//名    称：    void   stcModelTostcModelComplex(stcModelComplex * sComplexModel,stcModel	* sModel)
//功    能：    取油箱模型
//入口参数：    油箱模型指针
//出口参数：    无
//------------------------------------------------------------------------------
extern	void   stcModelComplexTostcModelSemple(stcModelSemple * sModelSemple,stcModelComplex	* sComplexModel);



#endif
