#ifndef  _ErrorSys_h_
#define  _ErrorSys_h_


//------------------------------------------------------------------------
// 名    称：   void  ErrDealSys(void)
// 功    能：   故障处理系统
// 入口参数：	无
// 出口参数:	无
// 说明:如果出现多故障,则先向应优先级高的故障
//------------------------------------------------------------------------
extern	void  ErrDealSys(void);

//------------------------------------------------------------------------
// 名    称：   uint8  GetStoreErrTyp(void)
// 功    能：   取Flsh存储时的故障代码
// 入口参数：	无
// 出口参数:	无
// 说明:		存故障代码
//------------------------------------------------------------------------
extern	uint8  GetStoreErrTypCod(void);


//------------------------------------------------------------------------
// 名    称：   void  CardErrDeal(void)
// 功    能：   初始化错误代码缓冲区
// 入口参数：	无
// 出口参数:	无
// 说明:如果出现多故障,则先向应优先级高的故障
//------------------------------------------------------------------------
extern	void	InitErrDealSys(void);

//------------------------------------------------------
//函数名称:     IndicateRun()
//功    能:     指示油尺主机运行
//入口参数:     无
//出口参数:     无
//显示内容:     
//内容代码:	    
//-------------------------------------------------------
extern	void RunIndicate(void);
#endif