#ifndef  _EventSys_h_
#define  _EventSys_h_

//------------------------------------------------------------------------
// 名    称：   void  EvtDealSys(void)
// 功    能：   事件处理系统
// 入口参数：	无
// 出口参数:	无
// 
//------------------------------------------------------------------------
extern	void  EvtDealSys(void);

//------------------------------------------------------------------------
// 名    称：   void  CardEvtDeal(void)
// 功    能：   初始化错误代码缓冲区
// 入口参数：	无
// 出口参数:	无
// 说明:如果出现多故障,则先向应优先级高的故障
//------------------------------------------------------------------------
extern	uint8	GetEvtNoWriteNum(void);

//-------------------------------------------------------------------------------
//函数名称:        	uint8	JudgeFlshEvt(void)
//函数功能:       	判断Flsh事件
//入口参数:        	无
//出口参数:      	无
//-------------------------------------------------------------------------------
extern	uint8	JudgeFlshEvt(void);

//------------------------------------------------------------------------
// 名    称：   uint8  GetStoreEvtTyp(void)
// 功    能：   取Flsh存储时的故障代码
// 入口参数：	无
// 出口参数:	无
// 说明:		存故障代码
//------------------------------------------------------------------------
extern	uint8  GetStoreEvtTypCod(void);

//------------------------------------------------------------------------
// 名    称：   void  CardEvtDeal(void)
// 功    能：   初始化错误代码缓冲区
// 入口参数：	无
// 出口参数:	无
// 说明:如果出现多故障,则先向应优先级高的故障
//------------------------------------------------------------------------
extern	void	InitEvtDealSys(void);

#endif