#ifndef  _FramToFlsh_h_
#define  _FramToFlsh_h_

//------------------------------------------------------------------------
//  名  称 ：uint8 	ReadCurFlshRecNum(void)
//  功  能 ：读存能耗统计装置记录流水号
// 入口参数：无
// 出口参数：当前流水号
//------------------------------------------------------------------------
extern	uint32 ReadCurFlshRecNum_Flsh(void);


//------------------------------------------------------------------------
//  名  称 ：uint32 ReadLstRedFlshRecNum(void)
//  功  能 ：读存能耗统计装置上次写记录流水号
// 入口参数：无
// 出口参数：当前流水号
//------------------------------------------------------------------------
extern	uint32 ReadLstRedFlshRecNum_Flsh(void);


//------------------------------------------------------------------------
//  名  称 ：uint32 ReadOilBoxModel(stcModel sModel)
//  功  能 ：存油箱模型
// 入口参数：无
// 出口参数：当前流水号
//------------------------------------------------------------------------
//extern	uint8	ReadOilBoxModel_Flsh(stcModelCard * sModelCard);


//------------------------------------------------------------------------
//  名  称 ：uint8	ReadReviseHight(stcReviseHight * sReviseHight)
//  功  能 ：读修正高度值
// 入口参数：修正高度结构体指针
// 出口参数：成功：返回1，否则，返回0
//------------------------------------------------------------------------
extern	uint8	ReadAddDipVal_Flsh(stcAddDipVal * sAddDipVal);


//------------------------------------------------------------------------
//  名  称 ：uint32 ReadOilBoxModel(stcModel sModel)
//  功  能 ：存油箱模型
// 入口参数：无
// 出口参数：当前流水号
//------------------------------------------------------------------------
extern	uint8	ReadDensity_Flsh(stcDensity * sDensity);


//------------------------------------------------------------------------
//  名  称 ：uint8	ReadHostInfo(stcDeviceInfo *sDeviceInfo)
//  功  能 ：读能耗统计装置的出厂信息
// 入口参数：无
// 出口参数：存成功,返回TRUE,否则,返回FALSE
//------------------------------------------------------------------------
extern	uint8	ReadHostInfo_Flsh(stcDeviceInfo *sDeviceInfo);

//------------------------------------------------------------------------
//  名  称 ：uint8 StoreHostStation(stcHostStation  sHostSta)
//  功  能 ：存能耗统计装置初装车信息
// 入口参数：无
// 出口参数：存成功,返回TRUE,否则,返回FALSE
//------------------------------------------------------------------------
//extern	uint8 ReadFixInfo_Flsh(stcFixInfo * sFix);

//------------------------------------------------------------------------
//  名  称 ：uint32 ReadOilBoxModel(stcModel sModel)
//  功  能 ：存油箱模型
// 入口参数：无
// 出口参数：当前流水号
//------------------------------------------------------------------------
//extern	uint8	ReadReviseHight_Flsh(stcReviseHight * sReviseHight);


//------------------------------------------------------------------------
//  名  称 ：uint8	ReadSelectModel(uint8	ModelNum)
//  功  能 ：存油箱模型选择
// 入口参数：无
// 出口参数：无
//------------------------------------------------------------------------
extern	uint8	ReadSelectModel_Flsh(uint8	*ModelNum);


#endif